In [1]:
import pandas as pd
import numpy as np
import datetime
import sklearn

In [2]:
# Postulantes
postulantes = pd.read_csv('./data/postulantes_encoding_01.csv',\
                          low_memory=False)

# Avisos
avisos = pd.read_csv('./data/avisos_encoding_01.csv', \
                     low_memory=False)

# Transacciones
merged = pd.read_csv('./data/merged_encoding_01.csv', \
                     low_memory=False)

In [3]:
postulantes.count()

Unnamed: 0         504407
idpostulante       504407
sexo               504407
edad               504407
estado             504407
nivel_alcanzado    504407
dtype: int64

In [4]:
del postulantes['Unnamed: 0']

In [8]:
postulantes.head()

  idpostulante  sexo  edad  estado  nivel_alcanzado
0         NM5M     1  47.0     2.0              1.0
1         5awk     1  55.0     2.0              3.0
2         ZaO5     1  39.0     0.0              3.0
3         NdJl     2  49.0     1.0              4.0
4         eo2p     2  37.0     2.0              4.0

In [9]:
avisos.count()

idaviso                 25288
nombre_zona             25288
tipo_de_trabajo         25288
nivel_laboral           25288
nombre_area             25288
denominacion_empresa    25288
dtype: int64

In [11]:
del avisos['Unnamed: 0']
avisos.head()

,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,8725750,1,1,1,0,4005
1,17903700,1,1,1,7,1640
2,1000150677,0,1,1,4,1561
3,1000610287,1,1,1,4,4119
4,1000872556,1,1,1,5,1267

In [12]:
avisos_g = avisos
while len(avisos_g) < 504407:
    avisos_g = pd.concat([avisos_g, avisos])

In [13]:
avisos_g.count()

idaviso                 505760
nombre_zona             505760
tipo_de_trabajo         505760
nivel_laboral           505760
nombre_area             505760
denominacion_empresa    505760
dtype: int64

In [14]:
avisos_g = avisos_g[:504407]
avisos_g = sklearn.utils.shuffle(avisos_g)
avisos_g.count()

idaviso                 504407
nombre_zona             504407
tipo_de_trabajo         504407
nivel_laboral           504407
nombre_area             504407
denominacion_empresa    504407
dtype: int64

In [15]:
avisos_g = avisos_g.reset_index().drop('index',axis=1)

In [16]:
a_y_p = pd.concat([postulantes, avisos_g], axis = 1)
a_y_p.head()

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,NM5M,1,47.0,2.0,1.0,1112486615,1,1,2,5,756
1,5awk,1,55.0,2.0,3.0,1111208753,1,1,2,7,1779
2,ZaO5,1,39.0,0.0,3.0,1112340083,1,1,0,6,198
3,NdJl,2,49.0,1.0,4.0,1112513581,0,1,1,0,172
4,eo2p,2,37.0,2.0,4.0,1112503347,1,1,1,0,2043

In [17]:
del merged['Unnamed: 0']
merged.head()

,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,1112257047,NM5M,1,47.0,2.0,1.0,1,0,3,3,1369
1,1112257047,1kJqGb,1,34.0,1.0,3.0,1,0,3,3,1369
2,1112257047,eOE9Rr,1,39.0,0.0,3.0,1,0,3,3,1369
3,1112257047,Zrx8Xz,1,39.0,2.0,2.0,1,0,3,3,1369
4,1112257047,ZrKNQY,1,32.0,1.0,3.0,1,0,3,3,1369

Excluimos las combinaciones de avisos y postulantes que estén en el data frame de postulaciones, de manera tal que nos queden las "no postulaciones".

In [18]:
a_y_p = a_y_p.drop(pd.merge(a_y_p,merged,\
    how='inner',on=['idpostulante','idaviso']).index,axis=0)
a_y_p.count()

idpostulante            504122
sexo                    504122
edad                    504122
estado                  504122
nivel_alcanzado         504122
idaviso                 504122
nombre_zona             504122
tipo_de_trabajo         504122
nivel_laboral           504122
nombre_area             504122
denominacion_empresa    504122
dtype: int64

In [19]:
a_y_p['sepostulo'] = 0
a_y_p.head(2)

,idpostulante,sexo,edad,estado,nivel_alcanzado,idaviso,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa,sepostulo
285,1v6vO,2,36.0,2.0,4.0,1112440455,1,1,2,3,211,0
286,85AMz,2,38.0,1.0,3.0,1112099355,1,1,1,0,4002,0

In [20]:
merged['sepostulo'] = 1
merged.count()

idaviso                 7742942
idpostulante            7742942
sexo                    7742942
edad                    7742942
estado                  7742942
nivel_alcanzado         7742942
nombre_zona             7742942
tipo_de_trabajo         7742942
nivel_laboral           7742942
nombre_area             7742942
denominacion_empresa    7742942
sepostulo               7742942
dtype: int64

In [21]:
train_data = pd.concat([a_y_p, merged])
train_data.count()

denominacion_empresa    8247064
edad                    8247064
estado                  8247064
idaviso                 8247064
idpostulante            8247064
nivel_alcanzado         8247064
nivel_laboral           8247064
nombre_area             8247064
nombre_zona             8247064
sepostulo               8247064
sexo                    8247064
tipo_de_trabajo         8247064
dtype: int64

In [22]:
train_data.head()

,denominacion_empresa,edad,estado,idaviso,idpostulante,nivel_alcanzado,nivel_laboral,nombre_area,nombre_zona,sepostulo,sexo,tipo_de_trabajo
285,211,36.0,2.0,1112440455,1v6vO,4.0,2,3,1,0,2,1
286,4002,38.0,1.0,1112099355,85AMz,3.0,1,0,1,0,2,1
287,3737,66.0,0.0,1112212047,aXm1J,3.0,0,3,1,0,2,1
288,3714,38.0,1.0,1112397254,6VEEO,4.0,1,3,1,0,2,1
289,2159,42.0,2.0,1111772230,ezqvj,4.0,3,0,0,0,2,1

In [23]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
from collections import defaultdict

In [24]:
X = train_data[['denominacion_empresa','edad','estado','nivel_alcanzado'\
                ,'nivel_laboral','nombre_area','nombre_zona','sexo','tipo_de_trabajo']]
Y = train_data['sepostulo']

In [25]:
X_train, X_test, y_train, y_test = \
    train_test_split(X, Y, test_size=0.10, random_state=7506)

In [26]:
print("Tamaño de X:\t\t", len(X), "\nTamaño de X_train:\t", \
      len(X_train), "\nTamaño de X_test:\t", len(X_test), \
      "\n\nTamaño de y:\t\t", len(Y), "\nTamaño de y_train:\t",\
      len(y_train), "\nTamaño de y_test:\t", len(y_test))

Tamaño de X:		 8247064
Tamaño de X_train:	 7422357
Tamaño de X_test:	 824707

Tamaño de y:		 8247064
Tamaño de y_train:	 7422357
Tamaño de y_test:	 824707

In [27]:
import winsound
def play_beep():
    duration = 500  # millisecond
    freq = 480  # Hz
    winsound.Beep(freq, duration)
play_beep()

In [28]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
sc.fit(X_train)

datos_train_std = sc.transform(X_train)
datos_test_std = sc.transform(X_test)

In [29]:
from sklearn.linear_model import Perceptron

ppn = Perceptron(n_iter = 40,
                 eta0 = 0.1,
                 random_state = 0)

ppn.fit(datos_train_std, y_train)
play_beep()

c:\users\i860341\appdata\local\programs\python\python36\lib\site-packages\sklearn\linear_model\stochastic_gradient.py:117: DeprecationWarning: n_iter parameter is deprecated in 0.19 and will be removed in 0.21. Use max_iter and tol instead.
  DeprecationWarning)

In [30]:
from sklearn.metrics import accuracy_score
# Probamos la precisión con el set de prueba

pred = ppn.predict(datos_test_std)
play_beep()
precision = round(accuracy_score(y_test, pred) * 100, 2)
print(precision)

92.82

In [31]:
test_final = pd.read_csv('./data/test_final_100k.csv', low_memory=False)
test_final.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [32]:
a_predecir = pd.merge(test_final, postulantes, on = 'idpostulante', how = 'left')
a_predecir.count()

id                 100000
idaviso            100000
idpostulante       100000
sexo               100000
edad               100000
estado             100000
nivel_alcanzado    100000
dtype: int64

In [33]:
a_predecir = pd.merge(a_predecir, avisos, on = 'idaviso', how = 'left')
a_predecir.count()

id                      100000
idaviso                 100000
idpostulante            100000
sexo                    100000
edad                    100000
estado                  100000
nivel_alcanzado         100000
nombre_zona             100000
tipo_de_trabajo         100000
nivel_laboral           100000
nombre_area             100000
denominacion_empresa    100000
dtype: int64

In [34]:
a_predecir.head()

,id,idaviso,idpostulante,sexo,edad,estado,nivel_alcanzado,nombre_zona,tipo_de_trabajo,nivel_laboral,nombre_area,denominacion_empresa
0,0,739260,6M9ZQR,1,34.0,2.0,4.0,0,1,2,0,465
1,1,739260,6v1xdL,2,30.0,2.0,2.0,0,1,2,0,465
2,2,739260,ezRKm9,1,26.0,2.0,3.0,0,1,2,0,465
3,3,758580,1Q35ej,2,31.0,2.0,4.0,0,1,3,8,3895
4,4,758580,EAN4J6,1,53.0,0.0,3.0,0,1,3,8,3895

In [35]:
del a_predecir['id']
del a_predecir['idaviso']
del a_predecir['idpostulante']
array_a_predecir = a_predecir.values

In [36]:
prediccion = ppn.predict(a_predecir)

In [37]:
test_final['sepostulo'] = prediccion
test_final.head()

   id  idaviso idpostulante  sepostulo
0   0   739260       6M9ZQR          1
1   1   739260       6v1xdL          1
2   2   739260       ezRKm9          1
3   3   758580       1Q35ej          1
4   4   758580       EAN4J6          1

In [38]:
test_final.sepostulo.value_counts()

1    100000
Name: sepostulo, dtype: int64

In [52]:
del test_final['idaviso']
del test_final['idpostulante']
test_final.set_index('id', inplace = True)
test_final.to_csv('./submits/submit_perceptron2.csv', encoding='utf-8')